{
  "projects": [
    {
        "image": "dist/img/portfolio/overmeal.jpeg",
        "title": "Over Meal SG",
        "description": "Over Meal SG adalah aplikasi manajemen lembur yang dirancang untuk mempermudah pengajuan dan persetujuan lembur bagi karyawan. Uniknya, setiap pengajuan lembur yang disetujui akan memberikan jatah uang makan lembur, yang nantinya dapat digunakan di kantin kantor. Aplikasi ini memastikan proses pengajuan lembur menjadi lebih transparan, efisien, dan terintegrasi dengan sistem HR."
    },
    {
        "image": "dist/img/portfolio/superstar.jpeg",
        "title": "Superstar",
        "link": "https://sipenla.azurewebsites.net/",
        "description": "Superstar adalah aplikasi penilaian karyawan yang dirancang untuk membantu perusahaan dalam mengevaluasi kinerja, keterampilan, dan kompetensi karyawan secara sistematis dan objektif. Aplikasi ini memberikan analisis mendalam mengenai pencapaian individu maupun tim, sehingga dapat digunakan sebagai dasar dalam pengambilan keputusan terkait pengembangan karyawan, promosi, maupun pelatihan lebih lanjut."
    },
    {
        "image": "dist/img/portfolio/sicomen.jpeg",
        "title": "SiComen",
        "description": "SICOMEN adalah Sistem Informasi Coaching dan Monitoring yang dirancang untuk mempermudah proses pembinaan dan supervisi dalam suatu organisasi. Aplikasi ini memungkinkan pencatatan, pemantauan, serta evaluasi sesi coaching secara efisien, sehingga membantu dalam pengelolaan kinerja dan pencapaian target."
    },
    {
        "image": "dist/img/portfolio/sipenla-superapps.jpg",
        "title": "Sipenla SuperApps",
        "link": "https://sipenla.azurewebsites.net/",
        "description": "Project ini merupakan project yang saya bangun bersama teman saya, yaitu tentang monitoring seluruh kegiatan sekolah dari absensi guru, siswa, pegawai sekolah dan lain sebagainya. Project ini memiliki banyak fitur didalamnya. Disini pengembangan website menggunaan framework laravel dan untuk mobile menggunakan flutter."
    },
    {
        "image": "dist/img/portfolio/bem-u-unesa-2022.jpeg",
        "title": "BEM UNESA 2022",
        "link": "https://bem.unesa.ac.id/",
        "description": "BEM UNESA 2022 adalah website resmi Badan Eksekutif Mahasiswa Universitas Negeri Surabaya periode 2022 kabinet ruang karya, project ini saya buat bersama team menggunakan Laravel dan backend MySQL."
    },
    {
        "image": "dist/img/portfolio/mu-on.png",
        "title": "Mu-On",
        "link": "https://drive.google.com/drive/folders/1GSleNnumbTdgGkaJHUx350on9dzRHUTO?usp=sharing",
        "description": "Mu-On adalah platform musik online berbasis mobile yang berfungsi untuk mendengarkan musik dimanapun dan kapanpun. Aplikasi ini dibuat menggunakan Flutter dan terkoneksi dengan database Firebase."
    },
    {
        "image": "dist/img/portfolio/bullet-bamboo.png",
        "title": "Bullet Bamboo",
        "link": "https://drive.google.com/drive/folders/1HnVw9N8SmVsFXRdPkZeAxfkiTUiNjslV?usp=sharing",
        "description": "Bullet Bamboo adalah game 2D simpel yang dibuat menggunakan C# dengan teknologi Unity3D, dimana pemain harus mengalahkan pasukan penjajah dan mengumpulkan koin sebanyak-banyaknya. Game ini memiliki 3 level, yaitu level easy, medium, dan hard."
    },
    {
        "image": "dist/img/portfolio/informatic-engineering-unesa.png",
        "title": "Desktop Informatic Engineering UNESA",
        "link": "https://drive.google.com/drive/folders/1PHRAAbfwKvK3NgAAV4I8OwGCF2DUah09?usp=sharing",
        "description": "Desktop Informatic Engineering UNESA adalah aplikasi berbasis desktop guna pengenalan jurusan Teknik Informatika UNESA kepada calon mahasiswa baru, yang berisi informasi mengenai program studi, laboratorium, biro, dll. Aplikasi ini dibuat menggunakan C# dan terkoneksi dengan database MySQL."
    },
    {
      "image": "dist/img/portfolio/e-mon.png",
      "title": "E-MON",
      "link": "https://drive.google.com/drive/folders/1S-e79f--r0tYDX8-A1Ao2B8KaYbsoyFU?usp=sharing",
      "description": "E-Mon atau E-Monitoring Produk adalah web-aplikasi untuk monitoring produk mahasiswa D4 Manajemen Informatika (jurusan saya), dimana penguji / dosen dapat memberikan penilaian, kritik dan saran kepada produk yang di upload mahasiswa. Aplikasi ini dibuat menggunakan Laravel & terkoneksi dengan database MySQL."
    },
    {
      "image": "dist/img/portfolio/fil.mi.jpeg",
      "title": "FIL.MI",
      "link": "https://drive.google.com/drive/folders/1pcnWAi_XeEEtj0u4ZHnl-A1Cza9D3YBR?usp=sharing",
      "description": "Fil.mi adalah web-aplikasi streaming film secara online yang dapat dinikmati dimana saja yang dibuat menggunakan PHP Native, dan terkoneksi dengan database MySQL."
    },
    {
      "image": "dist/img/portfolio/e-loker.jpeg",
      "title": "E-Loker",
      "link": "http://e-loker.herokuapp.com/",
      "description": "E-Loker adalah web-aplikasi pencarian lowongan kerja online yang dibuat menggunakan HTML, CSS, dan JavaScript. Aplikasi ini hanya berupa antarmuka UI tanpa backend, karena merupakan proyek pertama saya."
    }
  ]
}
