{
  "projects": [
    {
        "image": "dist/img/portfolio/kpp-hauling-road.jpeg",
        "title": "KPP Hauling Road",
        "link": "https://kpp-dev.datacakra.com/",
        "description": "KPP Hauling Road adalah web-aplikasi PT. Kalimatan Prima Persada yang berfungsi menghitung agregat lepas, drainase buruk, lendutan permukaan, lubang permukaan, permukaan bergelombang, potongan melintang, pencemaran debu berdasarkan nilai deteksi URCI yang dipasang pada kendaraan. Aplikasi ini dibuat menggunakan React.JS dan terkoneksi dengan database PostgreSQL."
    },
    {
        "image": "dist/img/portfolio/sisfopimpinan.jpeg",
        "title": "SISFO PIMPINAN",
        "link": "https://sisfopimpinan.datacakra.com/",
        "description": "Dashboard Pimpinan Puspenerbal adalah web-aplikasi resmi yang bersifat rahasia dan hanya dapat diakses oleh pihak tertentu. Aplikasi ini dibuat menggunakan React.JS dan terkoneksi dengan database PostgreSQL."
    },
    {
        "image": "dist/img/portfolio/sisfotual.jpeg",
        "title": "SISFOTUAL",
        "link": "https://sisfotual.datacakra.com/",
        "description": "Sistem Informasi Tata Usaha Puspenerbal adalah web-aplikasi resmi yang bersifat rahasia dan hanya dapat diakses oleh pihak tertentu. Aplikasi ini dibuat menggunakan React.JS dan terkoneksi dengan database PostgreSQL."
    },
    {
        "image": "dist/img/portfolio/sisfoopsal.jpeg",
        "title": "SISFOOPSAL",
        "link": "https://sisfoopsal.datacakra.com/",
        "description": "Sistem Informasi Operasional Puspenerbal adalah web-aplikasi resmi yang bersifat rahasia dan hanya dapat diakses oleh pihak tertentu. Aplikasi ini dibuat menggunakan React.JS dan terkoneksi dengan database PostgreSQL."
    },
    {
        "image": "dist/img/portfolio/sisfolog.jpeg",
        "title": "SISFOLOG",
        "link": "https://sisfologal.datacakra.com/",
        "description": "Sistem Informasi Logistik Puspenerbal adalah web-aplikasi resmi yang bersifat rahasia dan hanya dapat diakses oleh pihak tertentu. Aplikasi ini dibuat menggunakan React.JS dan terkoneksi dengan database PostgreSQL."
    },
    {
        "image": "dist/img/portfolio/sisfok3.jpeg",
        "title": "SISFOK3",
        "link": "https://sisfok3al.datacakra.com/",
        "description": "Sistem Informasi Lambangja Puspenerbal adalah web-aplikasi resmi yang bersifat rahasia dan hanya dapat diakses oleh pihak tertentu. Aplikasi ini dibuat menggunakan React.JS dan terkoneksi dengan database PostgreSQL."
    },
    {
        "image": "dist/img/portfolio/sisfopersal.jpeg",
        "title": "SISFOPERSAL",
        "link": "https://sisfopersal.datacakra.com/",
        "description": "Sistem Informasi Personel Puspenerbal adalah web-aplikasi resmi yang bersifat rahasia dan hanya dapat diakses oleh pihak tertentu. Aplikasi ini dibuat menggunakan React.JS dan terkoneksi dengan database PostgreSQL."
    },
    {
        "image": "dist/img/portfolio/rapidsense-ai.jpeg",
        "title": "Rapidsense AI",
        "link": "http://rapidsense-ai-dev.datacakra.com/",
        "description": "Rapidsense AI adalah web-aplikasi product dari PT. Datacakra Solusi Jaganata yang berfungsi untuk memonitoring dan menganalisa data berdasarkan sensor secara real-time, seperti Machine Monitoring, Energy Meter, Waste Monitoring, Employee Tracker, Yard Management, PPIC, Envirobox, Water Level, Smartpole, Early Warning System (EWS) Flood & Forest Fire, Water Quality, Inventory Tracking, Fleet Management, dll. Aplikasi ini dibuat menggunakan React.JS dan terkoneksi dengan database PostgreSQL."
    },
    {
        "image": "dist/img/portfolio/logify-klinik.jpeg",
        "title": "Logify Klinik",
        "link": "https://drive.google.com/drive/folders/1RbWdAxN_0g820zHPRPsECjNdSf1e1QOT?usp=sharing",
        "description": "Logify Klinik adalah web-aplikasi resmi solusi manajemen klinik yang dirancang untuk mempermudah proses administrasi, pendaftaran, dan pengelolaan pasien di klinik. Aplikasi ini memungkinkan klinik untuk mengelola jadwal dokter, pendaftaran pasien, serta pencatatan riwayat medis secara terintegrasi, sehingga memastikan proses pelayanan kesehatan menjadi lebih efisien dan terstruktur. Aplikasi ini dibuat menggunakan React.JS dan terkoneksi dengan database PostgreSQL. (Saya melakukan maintenance dan penambahan fitur karena sudah existing sebelum saya bergabung)"
    },
    {
        "image": "dist/img/portfolio/web-drowsiness-detection.jpeg",
        "title": "Implementation Drowsiness Detection",
        "link": "https://www.youtube.com/watch?v=rALUWjZ6j8I",
        "description": "Project ini adalah pengembangan dari tugas akhir saya yang berfungsi untuk mendeteksi tingkat kantuk pada pengemudi dan diterapkan pada web-aplikasi, dimana apabila pengemudi terdeteksi sedang mengantuk maka akan muncul notifikasi untuk memberitahukan pengemudi agar berhenti sejenak dan suara alarm. Aplikasi ini dibuat menggunakan React.JS"
    },
    {
        "image": "dist/img/portfolio/drowsiness-detection.jpeg",
        "title": "Drowsiness Detection",
        "link": "https://www.youtube.com/watch?v=PKPSfA-mgjc",
        "description": "Drowsiness Detection adalah project tugas akhir saya yang berfungsi untuk mendeteksi tingkat kantuk pada pengemudi. Aplikasi ini dibuat menggunakan Python dengan library OpenCV dan YOLOv4."
    },
    {
        "image": "dist/img/portfolio/mpa-pelindo.jpeg",
        "title": "MPA Pelindo",
        "link": "https://mpa.pelindosolusilogistik.co.id/",
        "description": "MPA Pelindo adalah web-aplikasi resmi Pelindo Solusi Logistik yang dirancang untuk manajemen pemeliharaan aset di pelabuhan. Aplikasi ini memungkinkan perusahaan untuk mengelola inventarisasi aset, perencanaan pemeliharaan, serta pelaporan kondisi aset secara terintegrasi, sehingga memastikan aset perusahaan selalu dalam kondisi yang optimal. Aplikasi ini dibuat menggunakan React.JS dan terkoneksi dengan database PostgreSQL."
    },
    {
        "image": "dist/img/portfolio/logbase-pelindo.jpeg",
        "title": "Logbase Pelindo",
        "link": "https://logbase.co.id/",
        "description": "Logbase merupakan marketplace yang dikembangkan oleh PT Pelindo Solusi Logistik yang menyediakan fasilitas logistik, infrastruktur, peralatan serta kendaraan berat dan beberapa fasilitas lainnya. Logbase selalu berkomitmen untuk memberikan pelayanan terbaik, aman dan terpercaya demi perkembangan bisnis anda. Aplikasi ini dibuat menggunakan React.JS dan terkoneksi dengan database PostgreSQL."
    },
    {
        "image": "dist/img/portfolio/pro-xhome.jpeg",
        "title": "Pro-Xhome",
        "link": "https://pro-xhome.com/",
        "description": "Pro-xhome adalah web-aplikasi resmi solusi menyeluruh untuk keperluan waterproofing di berbagai macam tipe konstruksi dengan dukungan 2 teknologi brand hebat yang berpengalaman di kelasnya. Aplikasi ini dibuat menggunakan WordPress dan terkoneksi dengan database MySQL. (Saya melakukan maintenance dan penambahan fitur karena sudah existing sebelum saya bergabung)"
    },
    {
        "image": "dist/img/portfolio/pipapower.jpeg",
        "title": "Pipapower",
        "link": "https://pipapower.com/",
        "description": "Pipapower adalah web-aplikasi resmi PT Avia Avian Industri Pipa sebagai produsen pipa dan fitting uPVC (Unplasticized Poly Vinyl Chloride) diproduksi dengan mesin berteknologi modern dengan menggunakan bahan baku yang berkualitas tinggi untuk menghasilkan produk unggulan yang presisi dan bebas timbal (Lead Free). (Saya melakukan maintenance dan penambahan fitur karena sudah existing sebelum saya bergabung)"
    },
    {
        "image": "dist/img/portfolio/csr-tracking.jpeg",
        "title": "CSR Tracking",
        "link": "https://csr-tracking.avianbrands.com/",
        "description": "CSR Tracking adalah web-aplikasi resmi manajemen program Corporate Social Responsibility (CSR) Avian Brands yang dirancang untuk mempermudah perusahaan dalam melakukan perencanaan, pelaksanaan, dan evaluasi program CSR. Aplikasi ini memungkinkan perusahaan untuk mengelola program CSR secara terintegrasi, mulai dari perencanaan, pengajuan proposal, hingga pelaporan hasil program. Aplikasi ini dibuat menggunakan React.JS dan terkoneksi dengan database PostgreSQL. (Saya melakukan maintenance dan penambahan fitur karena sudah existing sebelum saya bergabung)"
    },
    {
        "image": "dist/img/portfolio/csr-metabase.jpeg",
        "title": "CSR Metabase",
        "link": "https://csr-mb.avianbrands.com/",
        "description": "CSR Metabase adalah web-aplikasi dashboard yang dirancang untuk mengolah data program Corporate Social Responsibility (CSR) Avian Brands. Aplikasi ini memungkinkan perusahaan untuk melihat data program CSR secara real-time, mulai dari jumlah program yang telah dilaksanakan, jumlah dana yang telah dikeluarkan, hingga dampak yang telah dihasilkan. Aplikasi ini berfungsi sebagai embedded image yang diambil dari PostgreSQL. (Saya melakukan maintenance dan penambahan fitur karena sudah existing sebelum saya bergabung)"
    },
    {
        "image": "dist/img/portfolio/avian-directus.jpeg",
        "title": "Avian Directus",
        "link": "https://directus.avianbrands.com",
        "description": "Avian Directus adalah web-aplikasi resmi Avian Brands yang berfungsi untuk memanajemen keseluruhan sistem pada perusahaan dimana akses yang diberikan hanya untuk direksi-direksi saja. Web-aplikasi ini dirancang untuk memudahkan direksi dalam melihat laporan-laporan yang dihasilkan oleh perusahaan. Aplikasi ini dibuat menggunakan React.JS dan terkoneksi dengan database PostgreSQL. (Saya melakukan maintenance dan penambahan fitur karena sudah existing sebelum saya bergabung)"
    },
    {
        "image": "dist/img/portfolio/avian-karir.jpeg",
        "title": "Avian Karir",
        "link": "https://karir.avianbrands.com/",
        "description": "Avian Karir adalah web-aplikasi resmi Avian Brands yang berfungsi untuk menampilkan lowongan pekerjaan yang tersedia di perusahaan. Web-aplikasi ini dirancang untuk memudahkan pencari kerja dalam mencari informasi mengenai lowongan pekerjaan yang sesuai dengan minat dan kualifikasi mereka. Aplikasi ini dibuat menggunakan React.JS dan terkoneksi dengan database PostgreSQL. (Saya melakukan maintenance dan penambahan fitur karena sudah existing sebelum saya bergabung)"
    },
    {
        "image": "dist/img/portfolio/avian-web.jpeg",
        "title": "Avian Web",
        "link": "https://avianbrands.com/",
        "description": "Avian Web adalah web-aplikasi resmi Avian Brands, sebuah perusahaan yang bergerak di bidang produksi dan distribusi produk-produk cat. Web-aplikasi ini dirancang untuk memberikan informasi mengenai produk-produk yang dijual, serta memudahkan konsumen dalam melakukan pembelian secara online, selain web-aplikasi aplikasi ini juga tersedia dalam versi mobile Android maupun IOS. Aplikasi ini dibuat menggunakan React.JS dan terkoneksi dengan database PostgreSQL. (Saya melakukan maintenance dan penambahan fitur karena sudah existing sebelum saya bergabung)"
    },
    {
        "image": "dist/img/portfolio/pmms-pg.png",
        "title": "PMMS PG",
        "link": "https://pmms.petrokimia-gresik.com/",
        "description": "PMMS PG adalah web-aplikasi resmi Petrokimia Gresik sampai 2023 yang dirancang untuk manajemen pemeliharaan aset. Aplikasi ini memungkinkan perusahaan untuk mengelola inventarisasi aset, perencanaan pemeliharaan, serta pelaporan kondisi aset secara terintegrasi, sehingga memastikan aset perusahaan selalu dalam kondisi yang optimal. Aplikasi ini dibuat menggunakan React.JS dan terkoneksi dengan database PostgreSQL. (Saya melakukan maintenance dan penambahan fitur karena sudah existing sebelum saya bergabung)"
    },
    {
        "image": "dist/img/portfolio/overmeal.jpeg",
        "title": "Over Meal SG",
        "description": "Over Meal SG adalah aplikasi manajemen lembur yang dirancang untuk mempermudah pengajuan dan persetujuan lembur bagi karyawan. Uniknya, setiap pengajuan lembur yang disetujui akan memberikan jatah uang makan lembur, yang nantinya dapat digunakan di kantin kantor. Aplikasi ini memastikan proses pengajuan lembur menjadi lebih transparan, efisien, dan terintegrasi dengan sistem HR."
    },
    {
        "image": "dist/img/portfolio/superstar.jpeg",
        "title": "Superstar",
        "link": "https://sipenla.azureweb-aplikasis.net/",
        "description": "Superstar adalah aplikasi penilaian karyawan yang dirancang untuk membantu perusahaan dalam mengevaluasi kinerja, keterampilan, dan kompetensi karyawan secara sistematis dan objektif. Aplikasi ini memberikan analisis mendalam mengenai pencapaian individu maupun tim, sehingga dapat digunakan sebagai dasar dalam pengambilan keputusan terkait pengembangan karyawan, promosi, maupun pelatihan lebih lanjut."
    },
    {
        "image": "dist/img/portfolio/sicomen.jpeg",
        "title": "SiComen",
        "description": "SICOMEN adalah Sistem Informasi Coaching dan Monitoring yang dirancang untuk mempermudah proses pembinaan dan supervisi dalam suatu organisasi. Aplikasi ini memungkinkan pencatatan, pemantauan, serta evaluasi sesi coaching secara efisien, sehingga membantu dalam pengelolaan kinerja dan pencapaian target."
    },
    {
        "image": "dist/img/portfolio/sipenla-superapps.jpg",
        "title": "Sipenla SuperApps",
        "link": "https://sipenla.azureweb-aplikasis.net/",
        "description": "Project ini merupakan project yang saya bangun bersama teman saya, yaitu tentang monitoring seluruh kegiatan sekolah dari absensi guru, siswa, pegawai sekolah dan lain sebagainya. Project ini memiliki banyak fitur didalamnya. Disini pengembangan web-aplikasi menggunaan framework laravel dan untuk mobile menggunakan flutter."
    },
    {
        "image": "dist/img/portfolio/bem-u-unesa-2022.jpeg",
        "title": "BEM UNESA 2022",
        "link": "https://bem.unesa.ac.id/",
        "description": "BEM UNESA 2022 adalah web-aplikasi resmi Badan Eksekutif Mahasiswa Universitas Negeri Surabaya periode 2022 kabinet ruang karya, project ini saya buat bersama team menggunakan Laravel dan backend MySQL."
    },
    {
        "image": "dist/img/portfolio/mu-on.png",
        "title": "Mu-On",
        "link": "https://drive.google.com/drive/folders/1GSleNnumbTdgGkaJHUx350on9dzRHUTO?usp=sharing",
        "description": "Mu-On adalah platform musik online berbasis mobile yang berfungsi untuk mendengarkan musik dimanapun dan kapanpun. Aplikasi ini dibuat menggunakan Flutter dan terkoneksi dengan database Firebase."
    },
    {
        "image": "dist/img/portfolio/bullet-bamboo.png",
        "title": "Bullet Bamboo",
        "link": "https://drive.google.com/drive/folders/1HnVw9N8SmVsFXRdPkZeAxfkiTUiNjslV?usp=sharing",
        "description": "Bullet Bamboo adalah game 2D simpel yang dibuat menggunakan C# dengan teknologi Unity3D, dimana pemain harus mengalahkan pasukan penjajah dan mengumpulkan koin sebanyak-banyaknya. Game ini memiliki 3 level, yaitu level easy, medium, dan hard."
    },
    {
        "image": "dist/img/portfolio/informatic-engineering-unesa.png",
        "title": "Desktop Informatic Engineering UNESA",
        "link": "https://drive.google.com/drive/folders/1PHRAAbfwKvK3NgAAV4I8OwGCF2DUah09?usp=sharing",
        "description": "Desktop Informatic Engineering UNESA adalah aplikasi berbasis desktop guna pengenalan jurusan Teknik Informatika UNESA kepada calon mahasiswa baru, yang berisi informasi mengenai program studi, laboratorium, biro, dll. Aplikasi ini dibuat menggunakan C# dan terkoneksi dengan database MySQL."
    },
    {
      "image": "dist/img/portfolio/e-mon.png",
      "title": "E-MON",
      "link": "https://drive.google.com/drive/folders/1S-e79f--r0tYDX8-A1Ao2B8KaYbsoyFU?usp=sharing",
      "description": "E-Mon atau E-Monitoring Produk adalah web-aplikasi untuk monitoring produk mahasiswa D4 Manajemen Informatika (jurusan saya), dimana penguji / dosen dapat memberikan penilaian, kritik dan saran kepada produk yang di upload mahasiswa. Aplikasi ini dibuat menggunakan Laravel & terkoneksi dengan database MySQL."
    },
    {
      "image": "dist/img/portfolio/fil.mi.jpeg",
      "title": "FIL.MI",
      "link": "https://drive.google.com/drive/folders/1pcnWAi_XeEEtj0u4ZHnl-A1Cza9D3YBR?usp=sharing",
      "description": "Fil.mi adalah web-aplikasi streaming film secara online yang dapat dinikmati dimana saja yang dibuat menggunakan PHP Native, dan terkoneksi dengan database MySQL."
    },
    {
      "image": "dist/img/portfolio/e-loker.jpeg",
      "title": "E-Loker",
      "link": "http://e-loker.herokuapp.com/",
      "description": "E-Loker adalah web-aplikasi pencarian lowongan kerja online yang dibuat menggunakan HTML, CSS, dan JavaScript. Aplikasi ini hanya berupa antarmuka UI tanpa backend, karena merupakan proyek pertama saya."
    }
  ]
}
